000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. AREA-NUMERACAO.
000003 AUTHOR. LUIZ-GUSTAVO-SILVA.
000004 DATE-WRITTEN. 02-02-2021.
000005 REMARKS. NUM (11)983478156 / E-MAIL LUIZ.GSILVA@BANDTEC.COM.BR.
000006 DATA DIVISION.
000007 FILE SECTION.
000008 WORKING-STORAGE SECTION.
000009 PROCEDURE DIVISION.
000010*******************************************************************
000011*A AREA DE NUMERACAO (DA COLUNA 1 A 6), NAO TEM INTERFERENCIA DI- *
000012*RETA COM O CODIGO, SERVE PARA NUMERAR AS LINHAS DO PROGRAMA FONTE*
000013*PARA PODER TER UMA ORGANIZACAO MELHOR, FACILITANDO A LOCALIZACAO *
000014*DE INFORMACOES.                                                  *
000015*                                                                 *
000016*OBS:DE ACORDO COM AS REGRAS DO ANS85, DARIA PARA SE USAR A PRIME-*
000017*IRA COLUNA PARA TRANSFORMAR UMA LINHA EM COMENTÁRIO COLOCANDO-SE *
000018*O ASTERISCO (*).                                                 *
000019*******************************************************************
000020 END PROGRAM AREA-NUMERACAO.
