000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. AREA-NUMERACAO.
000003 DATA DIVISION.
000004 FILE SECTION.
000005 WORKING-STORAGE SECTION.
000006 PROCEDURE DIVISION.
000007*******************************************************************
000008*A AREA DE NUMERACAO (DA COLUNA 1 A 6), NAO TEM INTERFERENCIA DI- *
000009*RETA COM O CODIGO, SERVE PARA NUMERAR AS LINHAS DO PROGRAMA FONTE*
000010*PARA PODER TER UMA ORGANIZACAO MELHOR, FACILITANDO A LOCALIZACAO *
000011*DE INFORMACOES.                                                  *
000012*                                                                 *
000013*OBS:DE ACORDO COM AS REGRAS DO ANS85, DARIA PARA SE USAR A PRIME-*
000014*IRA COLUNA PARA TRANSFORMAR UMA LINHA EM COMENTÁRIO COLOCANDO-SE *
000015*O ASTERISCO (*).                                                 *
000016*******************************************************************
000017 END PROGRAM AREA-NUMERACAO.
