       IDENTIFICATION DIVISION.
       PROGRAM-ID. AREA-B.
       AUTHOR. LUIZ-GUSTAVO-SILVA.
       DATE-WRITTEN. 02-02-2021.
       REMARKS. NUM (11)983478156 / E-MAIL LUIZ.GSILVA@BANDTEC.COM.BR.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
      *******************************************************************
      *A AREA B (COLUNA 12 ATE A 72), SERVE PARA SE ESCREVER AS INSTRU- *
      *COES DO COBOL, POR EXEMPLO:                                      *
      *                                                                 *
           DISPLAY "SOU UMA INSTRUCAO".                                 ACREDITE OU NAO, SOU UM COMENTARIO
      *                                                                 *
      *JA DA COLUNA 73 EM DIANTE, SERVE-SE PARA COLOCAR COMENTARIO SEM  *
      *AFETAR A LINHA TODA.                                             *
      *******************************************************************
       END PROGRAM AREA-B.
