       IDENTIFICATION DIVISION.
       PROGRAM-ID. IDENTIFICATION-PROGRAM.
       AUTHOR. LUIZ-GUSTAVO-SILVA.
       DATE-WRITTEN. 02-02-2021.
       REMARKS. NUM (11)983478156 / E-MAIL LUIZ.GSILVA@BANDTEC.COM.BR.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
      *******************************************************************
       END PROGRAM IDENTIFICATION-PROGRAM.
