       IDENTIFICATION DIVISION.
       PROGRAM-ID. ENVIRONMENT-DIVISION.
       AUTHOR. LUIZ-GUSTAVO-SILVA.
       DATE-WRITTEN. 04-02-2021.
       REMARKS. NUM (11)983478156 / E-MAIL LUIZ.GSILVA@BANDTEC.COM.BR.
      *******************************************************************
      *ESTA DIVISAO CORRESPONDE AOS EQUIPAMENTOS QUE FAZEM PARTE DO PRO-*
      *GRAMA. POSSUI 2 SECTIONS E SEGUE A SEGUINTE ESTRUTURA:           *
      *                                                                 *
      *    ENVIRONMENT DIVISION                                         *
      *    CONFIGURATION SECTION                                        *
      *    SOURCE-COMPUTER. comentario.                                 *
      *    OBJECT-COMPUTER. comentario.                                 *
      *    SPECIAL-NAMES.                                               *
      *    INPUT-OUTPUT SECTION.                                        *
      *    FILE-CONTROL.                                                *
      *    I-O-CONTROL.                                                 *
      *                                                                 *
      *******************************************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           STOP RUN.
       END PROGRAM ENVIRONMENT-DIVISION.
