       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROCEDURE-DIVISION.
       AUTHOR. MATHEUS-SANTOS-DA-SILVA.
       DATE-WRITTEN. 09-02-2021.
       REMARKS. NUM (11)975640903 / E-MAIL MATHEUS.SSILVA@BANDTEC.COM.BR
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.

      *******************************************************************
      *                                                                 *
      *                                                                 *
      *                       PROCEDURE-DIVISION                        *
      *                                                                 *
      *                                                                 *
      *    ESTA E A ULTIMA DIVISAO. E NELA QUE SE CONTROLA A EXECUCAO DO*
      *PROGRAMA, ONDE SAO COLOCADOS OS COMANDOS ORIUNDOS DO ALGORITMO AS*
      *INSTRUCOES FEITAS NELA PODEM SER REUNIDAS EM PARAGRAFOS, E ESTES *
      *EM SECOES. EXEMPLO:                                              *
      *-----------------------------------------------------------------*
      *0000                ROTINA-PRINCIPAL SECTION.                    *
      *-----------------------------------------------------------------*
      *    PERFORM 1000-ENTRADA. – SEGUNDA SEÇÃO DO PROGRAMA            *
      *    PERFORM 2000- PROCESSAMENTO. – TERCEIRA SEÇÃO DO PROGRAMA    *
      *    PERFORM 3000-SAIDA. – QUARTA SEÇÃO DO PROGRAMA               *
      *-----------------------------------------------------------------*
      *0000 FIM. EXIT.                                             *
      *-----------------------------------------------------------------*
      *******************************************************************

       END PROGRAM PROCEDURE-DIVISION.
