      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "**************************************************"
           "**********************************"
            DISPLAY "***    	        Nome-do-Erro            ***     "
      -    "          Solucao             ***"
            DISPLAY "**************************************************"
           "**********************************"
            DISPLAY "***  'NomeDoArquivo.ext':Invalid argument  ***  O "
           "Nome do Arquivo esta invalido  ***"
            DISPLAY "**************************************************"
           "**********************************"
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
